SnowTests/src/test/resources/xmlpayload/findOrdersPayload.txt

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://enterprise/bpms/uiservices/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:OrderSearchRequest>
         <Context>
            <source>BPMPortal</source>
            <transactionId>BPMPortal-aa53648</transactionId>
            <requestor>aa53648</requestor>
            <version>v1_0</version>
         </Context>
         <coDomainViewOrderSearchCriteria>
            <serviceTypeSearchList/>
            <customerIdSearchList/>
            <actionSearchList/>
            <customerOrderIdSearchList>
               <customerOrderId>552687619</customerOrderId>
            </customerOrderIdSearchList>
            <submittedBySearchList/>
            <networkTypeDataList/>
            <designTypeDataList/>
            <carrierIdDataList/>
            <vendorOrderIdLList/>
            <ponList/>
            <eccktList/>
            <bandwidthList/>
            <expediteValueList/>
            <sourceSystemList/>
            <nxIndicator/>
            <hotcutIndicator/>
            <AcceleratedIndicator/>
            <commonDomainViewOrderSearchCriteria>
               <jeopCodeSearchList/>
               <orderStatusSearchList/>
               <orderTypeSearchList/>
            </commonDomainViewOrderSearchCriteria>
            <isAHub/>
            <usesAHub/>
            <isESA/>
            <accessForVoice/>
            <usesPDN/>
            <productNameList/>
            <bundleNameList/>
            <managedServiceProviderList/>
            <cnr/>
            <inboundAsrIndicator/>
            <upgradeOrderIndicator/>
            <isNni/>
            <transportTypeList/>
            <hybridConnectivityList/>
         </coDomainViewOrderSearchCriteria>
      </v1:OrderSearchRequest>
   </soapenv:Body>
</soapenv:Envelope>